CF/Catalogs/УдалитьДоговорыЭквайринга.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>УдалитьДоговорыЭквайринга</Name>
			<Comment>Договоры об использовании банковских карточек в качестве платежного средства</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Эквайрер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭквайрерВозвращаетКомиссиюПриВозврате</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТарифыЗаРасчетноеОбслуживание</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидОплаты</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыОплатЧекаККМ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентТорговойУступки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CF/Catalogs/УдалитьДоговорыЭквайринга/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция получает реквизиты которые необходимо заблокировать после сохранения.
// Возвращаемое значение:
//	Массив - массив наименований блокируемых реквизитов.
//
Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить("Организация");
	Возврат Результат;
	
КонецФункции

// Возвращает вид оплаты, если найден один вид оплаты в договоре эквайринга.
// 
// Параметры:
//	ДоговорыЭквайринга - СправочникСсылка.ДоговорыЭквайринга - Ссылка на договор эквайринга.
//
// Возвращаемое значение:
//	Структура - Вид оплаты договора эквайринга.
//
Функция ВидОплатыПоУмолчанию(ДоговорЭквайринга) Экспорт
	
	СтруктураПараметровПоУмолчанию = Новый Структура();
	Запрос = Новый Запрос();
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 2
	|	ДоговорыЭквайрингаТарифыЗаРасчетноеОбслуживание.ВидОплаты КАК ВидОплаты
	|ИЗ
	|	Справочник.УдалитьДоговорыЭквайринга.ТарифыЗаРасчетноеОбслуживание КАК ДоговорыЭквайрингаТарифыЗаРасчетноеОбслуживание
	|ГДЕ
	|	ДоговорыЭквайрингаТарифыЗаРасчетноеОбслуживание.Ссылка = &ДоговорЭквайринга
	|	И НЕ ДоговорыЭквайрингаТарифыЗаРасчетноеОбслуживание.Ссылка.ПометкаУдаления
	|";
	Запрос.УстановитьПараметр("ДоговорЭквайринга", ДоговорЭквайринга);
	ВыборкаПараметрыПоУмолчанию = Запрос.Выполнить().Выбрать();
	Если ВыборкаПараметрыПоУмолчанию.Количество() = 1.00 И ВыборкаПараметрыПоУмолчанию.Следующий() Тогда
		СтруктураПараметровПоУмолчанию.Вставить("ВидОплаты", ВыборкаПараметрыПоУмолчанию.ВидОплаты);
	Иначе
		СтруктураПараметровПоУмолчанию.Вставить("ВидОплаты", Справочники.ВидыОплатЧекаККМ.ПустаяСсылка());
	КонецЕсли;
	
	Возврат СтруктураПараметровПоУмолчанию;
	
КонецФункции

#КонецОбласти

#КонецЕсли
